tutorials/17YJunction/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    walls
    {
        type            patch;
        nFaces          532;
        startFace       21958;
    }
    inlet1
    {
        type            patch;
        nFaces          30;
        startFace       22490;
    }
    inlet2
    {
        type            patch;
        nFaces          30;
        startFace       22520;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       22550;
    }
    frontAndBack
    {
        type            empty;
        nFaces          26092;
        startFace       22580;
    }
)

// ************************************************************************* //
